# <font color='blue'> Pandas </font>

## Install Pandas

In [ ]:
# Install pandas using pip
pip install pandas
(or)
pip3 install pandas

### Upgrade Pandas

In [ ]:
pip install --upgrade pandas

### Check Pandas Version

In [ ]:
pd.__version__

## Importing pandas

In [1]:
# import librart
import pandas as pd
import numpy as np

## Creating DataFrames

In [9]:
scientists = pd.DataFrame({
'Name': ['Rosaline Franklin', 'William Gosset'],
'Occupation': ['Chemist', 'Statistician'],
'Born': ['1920-07-25', '1876-06-13'],
'Died': ['1958-04-16', '1937-10-16'],
'Age': [37, 61]})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [14]:
scientists = pd.DataFrame(
data = {'Occupation': ['Chemist', 'Statistician'],
'Born': ['1920-07-25', '1876-06-13'],
'Died': ['1958-04-16', '1937-10-16'],
'Age': [37, 61]},
index = ['Rosaline Franklin', 'William Gosset'],
)
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

### Create DataFrame from List

In [10]:
# Create pandas DataFrame from List
tech = [ ["Spark",20000, "30days"], 
                 ["Pandas",25000, "40days"]
               ]
df=pd.DataFrame(tech)
print(df)

        0      1       2
0   Spark  20000  30days
1  Pandas  25000  40days

In [11]:
# Add Column & Row Labels to the DataFrame
column_names=["Courses","Fee","Duration"]
row_label=["a","b"]
df=pd.DataFrame(tech,columns=column_names,index=row_label)
print(df)

  Courses    Fee Duration
a   Spark  20000   30days
b  Pandas  25000   40days

### Create DataFrame from Dictionary

In [12]:
# Create DataFrame from Dict
tech = {
    'Courses':["Spark","Pandas"],
    'Fee' :[20000,25000],
    'Duration':['30days','40days']
              }
df = pd.DataFrame(tech)
print(df)

  Courses    Fee Duration
0   Spark  20000   30days
1  Pandas  25000   40days

### Create DataFrame with Index

In [13]:
# Create DataFrame with Index.
technologies = {
    'Courses':["Spark","Pandas"],
    'Fee' :[20000,25000],
    'Duration':['30days','40days']
              }
index_label=["r1","r2"]
df = pd.DataFrame(technologies, index=index_label)
print(df)

   Courses    Fee Duration
r1   Spark  20000   30days
r2  Pandas  25000   40days

## Create Series

In [3]:
s = pd.Series(['orange',30])
s

0    orange
1        30
dtype: object

### Assign index to above series

In [6]:
s1 = pd.Series(['Jahanzaib Jaan', 'Bhalwal'],
index=['Name', 'Address'])
s1

Name       Jahanzaib Jaan
Address           Bhalwal
dtype: object

### Create Series from Numpy Array

In [8]:
import numpy as np
data = np.array(['math', 'physics', 'chemistry', 'biology'])
series = pd.Series(data)
series

0         math
1      physics
2    chemistry
3      biology
dtype: object

## Loading data

### Loading data from a csv file

In [2]:
# Load Dataset
df = pd.read_csv('D:/git/jaan_repo/datasets/drinks.csv')
df1 = pd.read_csv('D:/git/jaan_repo/datasets/IPL_matches(2008-2016).csv')

### Loading data from a tsv file

In [ ]:
#df = pd.read_table('filename.tsv', sep='\t')

### Loading data from a excel file

In [ ]:
#df = pd.read_excel('filename.xlsx')

### Loading data from website

In [ ]:
# url = 'website_link.com'
# df = pd.read_html(url)
# df = pd.read_csv(url)
# df = pd.read_json(url)
# df = pd.read_table(url)

### Loading data from seaborn

In [ ]:
# # import seaborn library
# import seaborn as sns
# # load dataset
# df = sns.load_dataset('tips')

## Save dataset in system

In [13]:
# df.to_csv('filename.csv')

## Data first look

In [3]:
# first 5 rows
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [4]:
# last 5 rows
df.tail()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [5]:
# to see the no of rows and columns
df.shape

(193, 6)

In [8]:
# see the detail of columns
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [7]:
# see column names in list format
df.columns.tolist()

['country',
 'beer_servings',
 'spirit_servings',
 'wine_servings',
 'total_litres_of_pure_alcohol',
 'continent']

In [9]:
# see no of rows only
df.shape[0]

193

In [10]:
# see no of columns only
df.shape[1]

6

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [12]:
df.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

## <font color='red'> Pandas Functions </font>

### <font color='green'> Data Types </font>

In [14]:
# see the data type of each column
df.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [15]:
df.country.dtypes

dtype('O')

#### Change Data Types

In [18]:
# change int to object(string)
df['beer_servings'] = df['beer_servings'].astype(str)

In [19]:
df.beer_servings.dtypes

dtype('O')

In [21]:
# change str into int
df['beer_servings'] = df['beer_servings'].astype(int)

In [22]:
df.beer_servings.dtypes

dtype('int32')

In [26]:
# change float into int
df['total_litres_of_pure_alcohol_int'] = df['total_litres_of_pure_alcohol'].round(0).astype(int)

In [24]:
df['total_litres_of_pure_alcohol']

0       0
1       5
2       1
3      12
4       6
       ..
188     8
189     2
190     0
191     2
192     5
Name: total_litres_of_pure_alcohol, Length: 193, dtype: int32

In [27]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,total_litres_of_pure_alcohol_int
0,Afghanistan,0,0,0,0.0,AS,0
1,Albania,89,132,54,4.9,EU,5
2,Algeria,25,0,14,0.7,AF,1
3,Andorra,245,138,312,12.4,EU,12
4,Angola,217,57,45,5.9,AF,6

#### Change mix( string + numeric) into int

In [ ]:
df['CN'] = pd.to_numeric(df['CN'], errors='coerce').astype('int64')

## we will use the above code when a column has mix data type like int and str
## after this code str will be converted into NaN

### <font color='green'> DataFrame.astype() </font>

In [ ]:
# astype() Syntax
DataFrame.astype(dtype, copy=True, errors='raise')

## astype ka function datatype ko change karny ky liya use hota hai

| Function | Description |
| :------: | :--------: |
|dtype| – Accepts a numpy.dtype or Python type to cast entire pandas object to the same type. Use {col: dtype, …}, where col is a column label and dtype is a numpy.dtype or Python type to cast one or more of the DataFrame’s columns.|
|copy| -Default True. Return a copy when copy=True (be very careful setting copy=False as changes to values then may propagate to other pandas objects).|
|errors| – Default raise.Use ‘raise’ to generate exception when unable to cast due to invalid data for type.Use ‘ignore’ to not raise exception (supress errors/exceptions). On error return original object.|

In [9]:
df.dtypes

## dtypes function dataframe ky har column ko data type ko check karne ke liya hai

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [12]:
# Create DataFrame from Dictionary
technologies = {
    'Courses':["Spark","PySpark","Hadoop"],
    'Fee' :["20000","25000","26000"],
    'Duration':['30day','40days','35days'],
    'Discount':["1000","2300","1500"]
              }

df_tech = pd.DataFrame(technologies)
print(df.dtypes)

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [8]:
# Change data type of column
df_tech.Fee = df_tech.Fee.astype('int')
#Alternate
#df_tech.Fee = df['Fee'].astype('int')
print(df_tech.dtypes)

Courses     object
Fee          int32
Duration    object
Discount    object
dtype: object

In [9]:
# change data type of columns
df_tech = df_tech.astype({'Courses':'string','Fee':'int','Discount':'float'})
print(df_tech.dtypes)

Courses      string
Fee           int32
Duration     object
Discount    float64
dtype: object

In [10]:
df_tech.Courses = df_tech.Courses.astype('int')

## jab string(jis mein numeric value na ho) ko int mein change karny ki koshish karen gy to error aay ga

ValueError: invalid literal for int() with base 10: 'Spark'

In [11]:
df_tech.Courses = df_tech.Courses.astype('int', errors='ignore')
print(df_tech.dtypes)

## above error ko igrone karny ky liya error param mein ignore put kar den.

Courses      string
Fee           int32
Duration     object
Discount    float64
dtype: object

### <font color='green'> pandas.DataFrame.mean() </font>

#### Syntax

In [ ]:
# Syntax of DataFrame.mean() 
DataFrame.mean(axis=None, skipna=None, level=None, numeric_only=None, **kwargs)

| Function | Description |
|------|------|
|axis| – Where to apply the mean rows/columns. For rows using index/0, for columns use column/1|
|skipna| – Excludes all None/NaN from teh mean result. Default set to True|
|level| – Use with multiindex. Takes int or level name, default None|
|numeric_only| – Excludes all non numeric values. Considers only int, float & boolean. bool, default None|
|**kwargs| – Additional keyword arguments to be passed to the function.|

In [3]:
val = df.mean()
print(val)

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_436\986055514.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  val = df.mean()

In [4]:
val1 = df1.mean()
print(val1)

id                 289.000000
season            2012.029463
dl_applied           0.025997
win_by_runs         13.715771
win_by_wickets       3.363951
umpire3                   NaN
dtype: float64

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_436\321238138.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  val1 = df1.mean()

In [5]:
# Calculate mean for all non numeric columns
val2 = df1.mean(numeric_only=True)
print(val2)

id                 289.000000
season            2012.029463
dl_applied           0.025997
win_by_runs         13.715771
win_by_wickets       3.363951
umpire3                   NaN
dtype: float64

In [7]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [5]:

# mean() on selected columns
val3 = df[['beer_servings','spirit_servings']].mean()
print(val3)

beer_servings      106.160622
spirit_servings     80.994819
dtype: float64

#### Ignore NaN from mean

In [ ]:
# Skip NaN Values
val4 = df.mean(axis=0,numeric_only=True,skipna=True)
print(val4)

#### Calculate Mean on Column axis

In [ ]:
# axis = 1 for column axis
val5 = df.mean(axis=1,numeric_only=True)
print(val5)

### <font color='green'> pandas.DataFrame.where() </font>

#### Syntax

In [ ]:
# DataFrame.where() syntax
DataFrame.where(cond, other=nan, inplace=False, axis=None, level=None, errors='raise', try_cast=NoDefault.no_default)

| Function | Description |
|------|------|
|cond| – Accepts one or more conditions. Takes eithere bool Series/DataFrame, array-like, or callable|
|other| – Value to replace with. Takes either scalar, Series/DataFrame, or callable|
|inplace| – If True, it updates the existing DataFrame and return None. Default set to False.|
|axis| – rows/columns axis. Takes int, default None|
|level| – Alignment leve.|
|errors| – Specify whether to raise any error in event of failure. Accepts str, {‘raise’, ‘ignore’}, default ‘raise’|
|try_cast| – Cast teh result basck to input type. (Available since 1.3.0 version)|

In [10]:
technologies= {
    'Courses':["Spark","PySpark","Spark","Python","PySpark"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1500,1000,1200,800,1300],
    'Duration':['30days','50days','30days','35days','40days']
          }
tech_df21 = pd.DataFrame(technologies)
print(tech_df21)

   Courses    Fee  Discount Duration
0    Spark  22000      1500   30days
1  PySpark  25000      1000   50days
2    Spark  23000      1200   30days
3   Python  24000       800   35days
4  PySpark  26000      1300   40days

In [12]:

# Default example
df4=tech_df21.where(tech_df21.Fee > 23000)
print(df4)

   Courses      Fee  Discount Duration
0      NaN      NaN       NaN      NaN
1  PySpark  25000.0    1000.0   50days
2      NaN      NaN       NaN      NaN
3   Python  24000.0     800.0   35days
4  PySpark  26000.0    1300.0   40days

In [13]:

# Use other param
df4=tech_df21.where(tech_df21.Fee > 23000,'NA')
print(df4)

   Courses    Fee Discount Duration
0       NA     NA       NA       NA
1  PySpark  25000     1000   50days
2       NA     NA       NA       NA
3   Python  24000      800   35days
4  PySpark  26000     1300   40days

#### Multiple Columns & Conditions

In [15]:
# Where on multiple columns & conditions
cond1 = tech_df21.Fee > 23000
cond2 = tech_df21.Discount > 900
df5 = tech_df21.where(cond1 & cond2, other='NA') 
print(df5)

   Courses    Fee Discount Duration
0       NA     NA       NA       NA
1  PySpark  25000     1000   50days
2       NA     NA       NA       NA
3       NA     NA       NA       NA
4  PySpark  26000     1300   40days

In [ ]:
# Updating on existing DataFrame
tech_df21.where(cond1 & cond2, 'NA', inplace=True) 
print(tech_df21)

### <font color='green'> dropna() </font>

#### Syntax

In [ ]:
# pandas.DataFrame.dropna() syntax
DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

In [3]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas",np.nan],
    'Fee' :[20000,25000,26000,23093,24000,np.nan],
    'Duration':['30day','40days','35days','45days',np.nan,np.nan],
    'Discount':[1000,np.nan,1200,2500,pd.NaT,np.nan],
    'NaN':[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]
              }
index_labels=['r1','r2','r3','r4','r5','r6']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses      Fee Duration Discount  NaN
r1    Spark  20000.0    30day     1000  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r4   Python  23093.0   45days     2500  NaN
r5   pandas  24000.0      NaN      NaT  NaN
r6      NaN      NaN      NaN      NaN  NaN

In [19]:
# Drop rows that has all Nan Values
df1 = df.dropna(how='all')
print(df1)

## how=all ka matlab hai ka jab tak row ki tamam values NaN hon to usy delete kar do

    Courses      Fee Duration Discount  NaN
r1    Spark  20000.0    30day     1000  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r4   Python  23093.0   45days     2500  NaN
r5   pandas  24000.0      NaN      NaT  NaN

In [21]:
# Drop columns that has all Nan Values
df2 = df.dropna(how='all',axis=1)
print(df2)

## axis=1 put karny sy column delete ho ga

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT
r6      NaN      NaN      NaN      NaN

In [22]:
# Drop rows that contains nan values
df3=df.dropna()
print(df3)

## is function ko apply karny sy jahan bhi NaN value ho gi wo column or rows delete ho jaen gi

   Courses      Fee Duration Discount
r1   Spark  20000.0    30day     1000
r3  Hadoop  26000.0   35days     1200
r4  Python  23093.0   45days     2500

#### dropna() on Specific Selected Columns

In [25]:
# Drop rows that has NaN values on selected columns
df4=df.dropna(subset=['Courses','Duration'])
print(df4)

    Courses      Fee Duration Discount  NaN
r1    Spark  20000.0    30day     1000  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r4   Python  23093.0   45days     2500  NaN

#### Drop NaN Values with Threshold

In [27]:
# With threshold, 
# Keep only the rows with at least 2 non-NA values.
df5=df.dropna(thresh=2)
df5

    Courses      Fee Duration Discount  NaN
r1    Spark  20000.0    30day     1000  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r4   Python  23093.0   45days     2500  NaN
r5   pandas  24000.0      NaN      NaT  NaN

### <font color='green'> pandas.DataFrame.fillna() </font>

#### Syntax

In [ ]:
# Syntax of pandas.DataFrame.fillna()
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)

|Fuction|Discription|
|:----:|:-----|
|value|  Takes either scalar, dict, Series, or DataFrame but not list.|
|method|  Takes one of these values {‘backfill’, ‘bfill’, ‘pad’, ‘ffill’, None}. Default None.
|axis|  0 or ‘index’, 1 or ‘columns’. Used to specifiy axis to fill the values.|
|inplace|  Default False. When used True, it updates existing DataFrame object.
|limit|  Specify how many fills should happen. This is the maximum number of consecutive NaN values replaced with specified value.|
|downcast|  It takes a dict of key-value pair that specifies data type to downcast . Like Float64 to int64, date to string e.t.c|

In [5]:
df

    Courses      Fee Duration Discount  NaN
r1    Spark  20000.0    30day     1000  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r4   Python  23093.0   45days     2500  NaN
r5   pandas  24000.0      NaN      NaT  NaN
r6      NaN      NaN      NaN      NaN  NaN

#### fillna NaN with None Value

In [4]:
# fillna to replace all NaN
df2=df.fillna('None')
print(df2)

## Agarorignal dataframe ko update karna hai to ~df.fillna('None', inplace=True)~ use kar den

    Courses      Fee Duration Discount   NaN
r1    Spark  20000.0    30day     1000  None
r2  PySpark  25000.0   40days     None  None
r3   Hadoop  26000.0   35days     1200  None
r4   Python  23093.0   45days     2500  None
r5   pandas  24000.0     None     None  None
r6     None     None     None     None  None

#### Fill NaN in one specific column

In [7]:
# fillna on one column
df2['Discount'] =  df['Discount'].fillna('0')
print(df2)

    Courses      Fee Duration Discount   NaN
r1    Spark  20000.0    30day     1000  None
r2  PySpark  25000.0   40days        0  None
r3   Hadoop  26000.0   35days     1200  None
r4   Python  23093.0   45days     2500  None
r5   pandas  24000.0     None        0  None
r6     None     None     None        0  None

#### Fill NaN on multiple columns

In [8]:
# fillna() on multiple columns
df2[['Discount','Fee']] =  df[['Discount','Fee']].fillna('0')
print(df2)

    Courses      Fee Duration Discount   NaN
r1    Spark  20000.0    30day     1000  None
r2  PySpark  25000.0   40days        0  None
r3   Hadoop  26000.0   35days     1200  None
r4   Python  23093.0   45days     2500  None
r5   pandas  24000.0     None        0  None
r6     None        0     None        0  None

In [9]:
# fillna() on multiple columns
df2 =  df.fillna(value={'Discount':'0','Fee':10000})
print(df2)

    Courses      Fee Duration Discount  NaN
r1    Spark  20000.0    30day     1000  NaN
r2  PySpark  25000.0   40days        0  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r4   Python  23093.0   45days     2500  NaN
r5   pandas  24000.0      NaN        0  NaN
r6      NaN  10000.0      NaN        0  NaN

#### With limit Parameter

In [11]:
# fill with limit
df2=df.fillna(value={'Discount':0,'Fee':0},limit=2)
print(df2)

    Courses      Fee Duration  Discount  NaN
r1    Spark  20000.0    30day    1000.0  NaN
r2  PySpark  25000.0   40days       0.0  NaN
r3   Hadoop  26000.0   35days    1200.0  NaN
r4   Python  23093.0   45days    2500.0  NaN
r5   pandas  24000.0      NaN       0.0  NaN
r6      NaN      0.0      NaN       NaN  NaN

### <font color='green'> loc[] </font>

#### Select Single Column & Row By Label using loc[]

In [12]:
# Select Single Column by label
print(df.loc[:, "Courses"])

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
r6        NaN
Name: Courses, dtype: object

In [13]:
# Select Single Row by label
print(df.loc['r3'])

Courses      Hadoop
Fee         26000.0
Duration     35days
Discount       1200
NaN             NaN
Name: r3, dtype: object

#### Select Multiple Rows & Columns

In [14]:
# Select Multiple Rows by Label
print(df.loc[['r2','r3']])

    Courses      Fee Duration Discount  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN

In [15]:
# Select Multiple Columns by labels
print(df.loc[:, ["Courses","Fee","Discount"]])

    Courses      Fee Discount
r1    Spark  20000.0     1000
r2  PySpark  25000.0      NaN
r3   Hadoop  26000.0     1200
r4   Python  23093.0     2500
r5   pandas  24000.0      NaT
r6      NaN      NaN      NaN

#### Select Between Two Rows or Columns

In [16]:
# Select Rows Between two Index Labels
# Includes both r1 and r4 rows
print(df.loc['r1':'r4'])

    Courses      Fee Duration Discount  NaN
r1    Spark  20000.0    30day     1000  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r4   Python  23093.0   45days     2500  NaN

In [17]:
# Select Columns between two Labels
# Includes both 'Fee' and 'Discount' columns
print(df.loc[:,'Fee':'Discount'])

        Fee Duration Discount
r1  20000.0    30day     1000
r2  25000.0   40days      NaN
r3  26000.0   35days     1200
r4  23093.0   45days     2500
r5  24000.0      NaN      NaT
r6      NaN      NaN      NaN

#### Select Alternate Rows or Columns

In [18]:

# Select Alternate rows By indeces
print(df.loc['r1':'r4':2])

   Courses      Fee Duration Discount  NaN
r1   Spark  20000.0    30day     1000  NaN
r3  Hadoop  26000.0   35days     1200  NaN

In [19]:
# Select Alternate Columns between two Labels
print(df.loc[:,'Fee':'Discount':2])

        Fee Discount
r1  20000.0     1000
r2  25000.0      NaN
r3  26000.0     1200
r4  23093.0     2500
r5  24000.0      NaT
r6      NaN      NaN

#### Using Conditions with pandas loc

In [20]:
# Using Conditions
print(df.loc[df['Fee'] >= 24000])

    Courses      Fee Duration Discount  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r5   pandas  24000.0      NaN      NaT  NaN

### <font color='green'> iloc[] </font>

#### Syntax

In [ ]:
df,iloc[start:stop:step,start:stop:step]

## Comma sy pahly row or comma ky baad column ki detail hai.

#### Select Single Row & Column By Index

In [21]:
# Select Single Row by Index
print(df.iloc[1])

Courses     PySpark
Fee         25000.0
Duration     40days
Discount        NaN
NaN             NaN
Name: r2, dtype: object

In [22]:

# Select Single Column by Index
print(df.iloc[:, 0])

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
r6        NaN
Name: Courses, dtype: object

#### Select Multiple Rows & Columns by Index

In [23]:
# Select Multiple Rows by Index
print(df.iloc[[1,2]])

    Courses      Fee Duration Discount  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN

In [24]:
# Select Multiple Columns by Index
print(df.iloc[:, [0,1,3]])

    Courses      Fee Discount
r1    Spark  20000.0     1000
r2  PySpark  25000.0      NaN
r3   Hadoop  26000.0     1200
r4   Python  23093.0     2500
r5   pandas  24000.0      NaT
r6      NaN      NaN      NaN

#### Select Rows or Columns by Index Range

In [25]:
# Select Rows Between two Indexs
# Includes Index 0 & Execludes 4
print(df.iloc[0:4])

    Courses      Fee Duration Discount  NaN
r1    Spark  20000.0    30day     1000  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r4   Python  23093.0   45days     2500  NaN

In [26]:
# Select Columns between two Indexes
# Includes Index 1 & Execludes 4
print(df.iloc[:,1:4])

        Fee Duration Discount
r1  20000.0    30day     1000
r2  25000.0   40days      NaN
r3  26000.0   35days     1200
r4  23093.0   45days     2500
r5  24000.0      NaN      NaT
r6      NaN      NaN      NaN

#### Select Alternate Rows or Columns

In [27]:
# Select Alternate rows By Index
print(df.iloc[0:4:2])

   Courses      Fee Duration Discount  NaN
r1   Spark  20000.0    30day     1000  NaN
r3  Hadoop  26000.0   35days     1200  NaN

In [28]:
# Select Alternate Columns between two Indexes
print(df.iloc[:,1:4:2])

        Fee Discount
r1  20000.0     1000
r2  25000.0      NaN
r3  26000.0     1200
r4  23093.0     2500
r5  24000.0      NaT
r6      NaN      NaN

#### Using Conditions with iloc[]

In [29]:
# By Condition
print(df.iloc[list(df['Fee'] >= 24000)])

    Courses      Fee Duration Discount  NaN
r2  PySpark  25000.0   40days      NaN  NaN
r3   Hadoop  26000.0   35days     1200  NaN
r5   pandas  24000.0      NaN      NaT  NaN

### <font color='green'> isin() </font>

In [ ]:
# Syntax of isin() Function
isin(values)

## values – iterable, Series, DataFrame or dict

In [13]:
# Specific Value
df_tech2=df_tech[df_tech['Courses'].isin(['Spark'])]
print(df_tech2)

## DataFrame mein kisi column sy kisi specific value find karny ky liya use hota hai

  Courses    Fee Duration Discount
0   Spark  20000    30day     1000

In [15]:

df_tech3=df_tech[df_tech['Courses'].isin(['Spark','Java'])]
print(df_tech3)

## isi function ko use karty hoy multiple values bhi finf ki ja sakti hen

  Courses    Fee Duration Discount
0   Spark  20000    30day     1000

In [17]:
df_tech

   Courses    Fee Duration Discount
0    Spark  20000    30day     1000
1  PySpark  25000   40days     2300
2   Hadoop  26000   35days     1500

In [23]:
# isin() with list of values
print(df_tech.isin(['Spark','Python','25000','35days']))

## is in function mein jab list pass karwaen gy to to jahan jahan value ho gi tru show kary ga

   Courses    Fee  Duration  Discount
0     True  False     False     False
1    False   True     False     False
2    False  False      True     False

In [25]:
print(df_tech.isin({'Courses': ['Spark', 'Hadoop']}))

## agar kisi specific column sy multiple values find karni ho to dic pass karwaen gy

   Courses    Fee  Duration  Discount
0     True  False     False     False
1    False  False     False     False
2     True  False     False     False

In [30]:
# Checks in another DataFrame
df_tech4 = pd.DataFrame({
    'Courses' :['C++','Python',],
    'Fee' :['23000','25000',],
    'Duration':['30days','55days']
          })
print(df_tech.isin(df_tech4))

   Courses    Fee  Duration  Discount
0    False  False     False     False
1    False   True     False     False
2    False  False     False     False

### <font color='green'> groupby() </font>

#### Syntax

In [ ]:
# Syntax of DataFrame.groupby()
DataFrame.groupby(by=None, axis=0, level=None, as_index=True, 
       sort=True, group_keys=True, squeeze=<no_default>, 
       observed=False, dropna=True)

#### Parameters Explanation

| Parameter | Description |
| :------: | :--------: |
|by| – List of column names to group by|
|axis| – Default to 0. It takes 0 or ‘index’, 1 or ‘columns’|
|level| – Used with MultiIndex.
|as_index| – sql style grouped otput.|
|sort| – Default to True. Specify whether to sort after group|
|group_keys| – add group keys or not|
|squeeze| – depricated in new versions|
|observed| – This only applies if any of the groupers are Categoricals.|
|dropna| – Default to False. Use True to drop None/Nan on sory keys|

In [4]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","NA"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df_tech5 = pd.DataFrame(technologies)
df_tech5

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

In [32]:
# Use groupby() to compute the sum
df_tech6 =df_tech5.groupby(['Courses']).sum()
print(df_tech6)

## df_tech5 ky dataframe mein sy courses ky column har unique value ko ikatha kar ky unki values ko sum kar diya

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

#### Groupby Multiple Columns

In [35]:
# Group by multiple columns
df_tech7 =df_tech5.groupby(['Courses', 'Duration']).sum()
print(df_tech7)

                    Fee  Discount
Courses Duration
Hadoop  35days    25000       0.0
        55days    23000    1000.0
NA      40days     1500       0.0
Pandas  60days    26000    2500.0
PySpark 50days    25000    2300.0
Python  40days    24000    1200.0
        50days    22000    1600.0
Spark   30days    47000    2400.0

#### Add Index

In [36]:
# Add Row Index to the group by result
df_tech8 = df_tech5.groupby(['Courses','Duration']).sum().reset_index()
print(df_tech8)

   Courses Duration    Fee  Discount
0   Hadoop   35days  25000       0.0
1   Hadoop   55days  23000    1000.0
2       NA   40days   1500       0.0
3   Pandas   60days  26000    2500.0
4  PySpark   50days  25000    2300.0
5   Python   40days  24000    1200.0
6   Python   50days  22000    1600.0
7    Spark   30days  47000    2400.0

#### Drop NA/NaN/None

In [37]:
# Drop rows that have None/Nan on group keys
df_tech9=df_tech5.groupby(by=['Courses'], dropna=False).sum()
print(df_tech9)

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

#### Sort Parameter

In [38]:
# Remove sorting on grouped results
df_tech10=df_tech5.groupby(by=['Courses'], sort=False).sum()
print(df_tech10)

## By default sort parameter true hota hai or wo groupby ky baad data ko sort karta hai
## Agar time ya performence issue hai to issy false kar den

           Fee  Discount
Courses
Spark    47000    2400.0
PySpark  25000    2300.0
Hadoop   48000    1000.0
Python   46000    2800.0
Pandas   26000    2500.0
NA        1500       0.0

In [39]:
# Sorting group keys on descending order
groupedDF = df_tech5.groupby('Courses',sort=False).sum()
sortedDF=groupedDF.sort_values('Courses', ascending=False)
print(sortedDF)


## Agar decending order mein sort karna hai to is code ko use karen

           Fee  Discount
Courses
Spark    47000    2400.0
Python   46000    2800.0
PySpark  25000    2300.0
Pandas   26000    2500.0
NA        1500       0.0
Hadoop   48000    1000.0

In [40]:

# Using apply() & lambda
df_tech5.groupby('Courses').apply(lambda x: x.sort_values('Fee'))

## Agar kisi or key kay mutabiq sort karna hai to lambda or apply function use karen

           Courses    Fee Duration  Discount
Courses
Hadoop  2   Hadoop  23000   55days    1000.0
        5   Hadoop  25000   35days       NaN
NA      8       NA   1500   40days       0.0
Pandas  4   Pandas  26000   60days    2500.0
PySpark 1  PySpark  25000   50days    2300.0
Python  7   Python  22000   50days    1600.0
        3   Python  24000   40days    1200.0
Spark   0    Spark  22000   30days    1000.0
        6    Spark  25000   30days    1400.0

#### groupby() + aggreagte()

In [5]:
# Groupby & multiple aggregations
result = df_tech5.groupby('Courses')['Fee'].aggregate(['min','max'])
print(result)

           min    max
Courses
Hadoop   23000  25000
NA        1500   1500
Pandas   26000  26000
PySpark  25000  25000
Python   22000  24000
Spark    22000  25000

In [6]:
# Groupby multiple columns & multiple aggregations
result1 = df_tech5.groupby('Courses').aggregate({'Duration':'count','Fee':['min','max']})
print(result1)

        Duration    Fee
           count    min    max
Courses
Hadoop         2  23000  25000
NA             1   1500   1500
Pandas         1  26000  26000
PySpark        1  25000  25000
Python         2  22000  24000
Spark          2  22000  25000

### <font color='green'> pandas.to_datetime() </font>

In [4]:
import datetime as dt

In [5]:
today_date = dt.date(2022,8,21) # year, month, day

In [6]:
print(today_date.day)
print(today_date.month)
print(today_date.year)

21
8
2022

In [7]:
today_datetime = dt.datetime(2022,8,22,9,33,20) # year, month, day ,hour,minutes,seconds
print(today_datetime)

2022-08-22 09:33:20

In [8]:
print(today_datetime.year)
print(today_datetime.month)
print(today_datetime.day)
print(today_datetime.hour)

2022
8
22
9

In [ ]:

# pandas.to_datetime() syntax
pandas.to_datetime(arg, errors='raise', dayfirst=False, yearfirst=False, 
     utc=None, format=None, exact=True, unit=None, 
     infer_datetime_format=False, origin='unix', cache=True)

| Function | Description |
| :------: | :--------: |
|arg |– An integer, string, float, list, or DataFrame/dict_like object to convert into a Datetime object.|
|errors| – Take values raise, ignore or coerce. if ‘raise’ used, raise a KeyError when a dict-like mapper, index, or columns contains labels that are not present in the Index being transformed. Default set to ignore.|
|dayfirst| – default set False, Boolean value places day first if True.|
|yearfirst| – Boolean value places year first if True, the default set False.|
|utc| – Boolean value, Returns the time in UTC DatetimeIndex if True.|
|format| – String input to tell the position of the day, month, and year. default set None.|
|exact| – Boolean value, If True, require an exact format match. – If False, allow the format to match anywhere in the target string.|
|infer_datetime_formatbool| – If True and no format is given, attempt to infer the format of the datetime strings based on the first non-NaN element. the default set False.|

### <font color='green'> head() </font>

In [ ]:
# Syntax of head() method
DataFrame.head(n)
Series.head(n)

In [4]:
# Default return 5 rows
print(df.head())

       country  beer_servings  spirit_servings  wine_servings  \
0  Afghanistan              0                0              0
1      Albania             89              132             54
2      Algeria             25                0             14
3      Andorra            245              138            312
4       Angola            217               57             45

   total_litres_of_pure_alcohol continent
0                           0.0        AS
1                           4.9        EU
2                           0.7        AF
3                          12.4        EU
4                           5.9        AF

In [5]:
# Top N rows
print(df.head(3))

       country  beer_servings  spirit_servings  wine_servings  \
0  Afghanistan              0                0              0
1      Albania             89              132             54
2      Algeria             25                0             14

   total_litres_of_pure_alcohol continent
0                           0.0        AS
1                           4.9        EU
2                           0.7        AF

In [6]:
# Except last N rows
print(df.head(-3))

## is parameter ki waja sy last 3 rows ko chor ky baqi answer milyga

         country  beer_servings  spirit_servings  wine_servings  \
0    Afghanistan              0                0              0
1        Albania             89              132             54
2        Algeria             25                0             14
3        Andorra            245              138            312
4         Angola            217               57             45
..           ...            ...              ...            ...
185      Uruguay            115               35            220
186   Uzbekistan             25              101              8
187      Vanuatu             21               18             11
188    Venezuela            333              100              3
189      Vietnam            111                2              1

     total_litres_of_pure_alcohol continent
0                             0.0        AS
1                             4.9        EU
2                             0.7        AF
3                            12.4        EU
4                             5.9        AF
..                            ...       ...
185                           6.6        SA
186                           2.4        AS
187                           0.9        OC
188                           7.7        SA
189                           2.0        AS

[190 rows x 6 columns]

In [7]:
# head() example
print(df['country'].head())

## head() function series par bhi apply ho sakta hai.
## or DataFrame ka har column aik series hota hai.

0    Afghanistan
1        Albania
2        Algeria
3        Andorra
4         Angola
Name: country, dtype: object

In [4]:
df.country.head()

0    Afghanistan
1        Albania
2        Algeria
3        Andorra
4         Angola
Name: country, dtype: object

### <font color='green'> Unique Function </font>

In [29]:
df.country.unique()

## with this code we can see the unique values in a column

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia-Herzegovina', 'Botswana', 'Brazil', 'Brunei',
       'Bulgaria', 'Burkina Faso', 'Burundi', "Cote d'Ivoire",
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada',
       'Central African Republic', 'Chad', 'Chile', 'China', 'Colombia',
       'Comoros', 'Congo', 'Cook Islands', 'Costa Rica', 'Croatia',
       'Cuba', 'Cyprus', 'Czech Republic', 'North Korea', 'DR Congo',
       'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon', 'Gambia',
       'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada', 'Guatemala',
       'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
       'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kiribati', 'Kuwait', 'Kyrgyzstan', 'Laos',
       'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Marshall Islands', 'Mauritania', 'Mauritius',
       'Mexico', 'Micronesia', 'Monaco', 'Mongolia', 'Montenegro',
       'Morocco', 'Mozambique', 'Myanmar', 'Namibia', 'Nauru', 'Nepal',
       'Netherlands', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria',
       'Niue', 'Norway', 'Oman', 'Pakistan', 'Palau', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Qatar', 'South Korea', 'Moldova', 'Romania',
       'Russian Federation', 'Rwanda', 'St. Kitts & Nevis', 'St. Lucia',
       'St. Vincent & the Grenadines', 'Samoa', 'San Marino',
       'Sao Tome & Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'Spain', 'Sri Lanka',
       'Sudan', 'Suriname', 'Swaziland', 'Sweden', 'Switzerland', 'Syria',
       'Tajikistan', 'Thailand', 'Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad & Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Tuvalu', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'Tanzania', 'USA', 'Uruguay', 'Uzbekistan',
       'Vanuatu', 'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [31]:
df['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia-Herzegovina', 'Botswana', 'Brazil', 'Brunei',
       'Bulgaria', 'Burkina Faso', 'Burundi', "Cote d'Ivoire",
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada',
       'Central African Republic', 'Chad', 'Chile', 'China', 'Colombia',
       'Comoros', 'Congo', 'Cook Islands', 'Costa Rica', 'Croatia',
       'Cuba', 'Cyprus', 'Czech Republic', 'North Korea', 'DR Congo',
       'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon', 'Gambia',
       'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada', 'Guatemala',
       'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
       'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kiribati', 'Kuwait', 'Kyrgyzstan', 'Laos',
       'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Marshall Islands', 'Mauritania', 'Mauritius',
       'Mexico', 'Micronesia', 'Monaco', 'Mongolia', 'Montenegro',
       'Morocco', 'Mozambique', 'Myanmar', 'Namibia', 'Nauru', 'Nepal',
       'Netherlands', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria',
       'Niue', 'Norway', 'Oman', 'Pakistan', 'Palau', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Qatar', 'South Korea', 'Moldova', 'Romania',
       'Russian Federation', 'Rwanda', 'St. Kitts & Nevis', 'St. Lucia',
       'St. Vincent & the Grenadines', 'Samoa', 'San Marino',
       'Sao Tome & Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'Spain', 'Sri Lanka',
       'Sudan', 'Suriname', 'Swaziland', 'Sweden', 'Switzerland', 'Syria',
       'Tajikistan', 'Thailand', 'Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad & Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Tuvalu', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'Tanzania', 'USA', 'Uruguay', 'Uzbekistan',
       'Vanuatu', 'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [30]:
df['total_litres_of_pure_alcohol'].value_counts()

##

0.0     13
0.1      7
2.2      6
6.3      5
4.9      4
        ..
12.9     1
0.8      1
5.5      1
9.3      1
8.7      1
Name: total_litres_of_pure_alcohol, Length: 90, dtype: int64

In [32]:
df['total_litres_of_pure_alcohol'].count()

193

In [34]:
df1.head()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2008,Bangalore,2008-04-18,Kolkata Knight Riders,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Kolkata Knight Riders,140,0,BB McCullum,M Chinnaswamy Stadium,Asad Rauf,RE Koertzen,NaN
1,2,2008,Chandigarh,2008-04-19,Chennai Super Kings,Kings XI Punjab,Chennai Super Kings,bat,normal,0,Chennai Super Kings,33,0,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",MR Benson,SL Shastri,NaN
2,3,2008,Delhi,2008-04-19,Rajasthan Royals,Delhi Daredevils,Rajasthan Royals,bat,normal,0,Delhi Daredevils,0,9,MF Maharoof,Feroz Shah Kotla,Aleem Dar,GA Pratapkumar,NaN
3,4,2008,Mumbai,2008-04-20,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,normal,0,Royal Challengers Bangalore,0,5,MV Boucher,Wankhede Stadium,SJ Davis,DJ Harper,NaN
4,5,2008,Kolkata,2008-04-20,Deccan Chargers,Kolkata Knight Riders,Deccan Chargers,bat,normal,0,Kolkata Knight Riders,0,5,DJ Hussey,Eden Gardens,BF Bowden,K Hariharan,NaN

In [35]:
df1.columns

Index(['id', 'season', 'city', 'date', 'team1', 'team2', 'toss_winner',
       'toss_decision', 'result', 'dl_applied', 'winner', 'win_by_runs',
       'win_by_wickets', 'player_of_match', 'venue', 'umpire1', 'umpire2',
       'umpire3'],
      dtype='object')

In [36]:
pd.value_counts(df1['venue'])

## to see the all unique values in a column

M Chinnaswamy Stadium                                   58
Eden Gardens                                            54
Feroz Shah Kotla                                        53
Wankhede Stadium                                        49
MA Chidambaram Stadium, Chepauk                         48
Rajiv Gandhi International Stadium, Uppal               41
Punjab Cricket Association Stadium, Mohali              35
Sawai Mansingh Stadium                                  33
Dr DY Patil Sports Academy                              17
Subrata Roy Sahara Stadium                              17
Kingsmead                                               15
SuperSport Park                                         12
Sardar Patel Stadium, Motera                            12
Dr. Y.S. Rajasekhara Reddy ACA-VDCA Cricket Stadium     11
Brabourne Stadium                                       11
Himachal Pradesh Cricket Association Stadium             9
New Wanderers Stadium                                    8
Maharashtra Cricket Association Stadium                  8
Newlands                                                 7
Barabati Stadium                                         7
Punjab Cricket Association IS Bindra Stadium, Mohali     7
St George's Park                                         7
Dubai International Cricket Stadium                      7
JSCA International Stadium Complex                       7
Sheikh Zayed Stadium                                     7
Sharjah Cricket Stadium                                  6
Shaheed Veer Narayan Singh International Stadium         6
Saurashtra Cricket Association Stadium                   5
Nehru Stadium                                            5
De Beers Diamond Oval                                    3
Vidarbha Cricket Association Stadium, Jamtha             3
Buffalo Park                                             3
OUTsurance Oval                                          2
Holkar Cricket Stadium                                   2
Green Park                                               2
Name: venue, dtype: int64

### <font color='green'> pandas.DataFrame.join() </font>

#### Syntax

In [ ]:
DataFrame.join(other, on=None, how='left', lsuffix= ' ', rsuffix= ' ', sort =False)

| Function | Description |
| :------: | :--------: |
|other |Pass Right DataFrame object or list of DataFrame Objects|
|on| Specify which index you want to join on when you have multiple indexes |
| how|use to specify the join type. Accepts *inner*,*left*,*right*,*outer*|
|lsuffix|Specify the left suffix string to column names|
|rsuffix|Specify the right suffix string to column names|
|sort|To specify the results to be sorted|

Agar *lsuffix* or *rsuffix* define nahi karen gy to columns overlap error aay ga
Left or Right suffix ki jo value put karen gy wohi duplicate collumns ka label mein show ho ga.
- Agar kuch nahi likhna chahty to just space enter kar den

In [17]:
df3 = df1.join(df2,lsuffix=" ", how = 'outer')
df3

              name  serving_size  calories              name total_fat
f1       Cornstarch        100 g     381.0        Cornstarch     0.1 g
f2     Nuts, pecans        100 g     691.0               NaN       NaN
f3    Eggplant, raw        100 g      25.0     Eggplant, raw     0.2 g
f4   Teff, uncooked        100 g     367.0               NaN       NaN
f5  Sherbet, orange        100 g     144.0               NaN       NaN
f6              NaN          NaN       NaN  Cauliflower, raw     0.3 g
f7              NaN          NaN       NaN  Taro leaves, raw     0.7 g

In [1]:
# importing required libraries
import pandas as pd

In [20]:
# Creating first DataFrame
food1 = {
    'name' :['Cornstarch','Nuts, pecans','Eggplant, raw','Teff, uncooked','Sherbet, orange'],
    'serving_size' :['100 g', '100 g','100 g','100 g','100 g'],
    'calories' :[381, 691, 25, 367, 144]
}
index_labels1 = ['f1','f2','f3','f4','f5']
df1 = pd.DataFrame(food1, index =index_labels1)
df1

               name serving_size  calories
f1       Cornstarch        100 g       381
f2     Nuts, pecans        100 g       691
f3    Eggplant, raw        100 g        25
f4   Teff, uncooked        100 g       367
f5  Sherbet, orange        100 g       144

In [21]:
# Creating Second DataFrame
food2 = {
    'name' :['Cornstarch','Cauliflower, raw','Eggplant, raw','Taro leaves, raw'],
    'total_fat' :['0.1 g', '0.3 g','0.2 g','0.7 g'],
}
index_labels2 = ['f1','f6','f3','f7']
df2 = pd.DataFrame(food2, index =index_labels2)
df2

                name total_fat
f1        Cornstarch     0.1 g
f6  Cauliflower, raw     0.3 g
f3     Eggplant, raw     0.2 g
f7  Taro leaves, raw     0.7 g

Agar *how* mention nahi karen gy to first DataFrame ki rows hi second ky hisab sy update hon gi
- Nechy result mein daikhen to first DataFrame ki tamam rows mojood hen or un men second DataFrame ky *total_fat* ki values update ho gae hen 
- Second DataFrame ki koe bhi new row add nhi hoe

In [22]:
# without how parameter
df3 = df1.join(df2, lsuffix="_left", rsuffix="_right")
df3

          name_left serving_size  calories     name_right total_fat
f1       Cornstarch        100 g       381     Cornstarch     0.1 g
f2     Nuts, pecans        100 g       691            NaN       NaN
f3    Eggplant, raw        100 g        25  Eggplant, raw     0.2 g
f4   Teff, uncooked        100 g       367            NaN       NaN
f5  Sherbet, orange        100 g       144            NaN       NaN

#### Inner Join

Agar *how* ko 'inner' put karen gy to donon DataFrames ki sirf wo rows hi rahen gi jinka index same ho ga.
- inner join ny **df1** sy f2,f4,f5 or **df2** sy f6, f7 frop kar den

![](resources/inner.png)

In [23]:
# inner join
df4 = df1.join(df2, lsuffix="_left", rsuffix="_right", how= 'inner')
df4

        name_left serving_size  calories     name_right total_fat
f1     Cornstarch        100 g       381     Cornstarch     0.1 g
f3  Eggplant, raw        100 g        25  Eggplant, raw     0.2 g

#### Right Join

- Right join mein second DataFrame ki sari rows hon gi magar first ki sirf wo hon gi jo second mein bhi hen 
- magar column donon ky hon gy 
- Jo column common hon gy unky duplicate(right,left) ban jaen gy
- First ki jo values second mein nahi hon gi wahan NaN aa jay ga

![](resources/right.png)

In [24]:
# right join
df5 = df1.join(df2, lsuffix="_left", rsuffix="_right", how= 'right')
df5

        name_left serving_size  calories        name_right total_fat
f1     Cornstarch        100 g     381.0        Cornstarch     0.1 g
f6            NaN          NaN       NaN  Cauliflower, raw     0.3 g
f3  Eggplant, raw        100 g      25.0     Eggplant, raw     0.2 g
f7            NaN          NaN       NaN  Taro leaves, raw     0.7 g

#### Left Join

- Left join mein First DataFrame ki sari rows hon gi magar second ki sirf wo hon gi jo first mein bhi hen 
- magar column donon ky hon gy 
- Jo column common hon gy unky duplicate(right,left) ban jaen gy
- Second ki jo values first mein nahi hon gi wahan NaN aa jay ga

![](resources/left.png)

In [25]:
# left join
df6 = df1.join(df2, lsuffix="_left", rsuffix="_right", how= 'left')
df6

          name_left serving_size  calories     name_right total_fat
f1       Cornstarch        100 g       381     Cornstarch     0.1 g
f2     Nuts, pecans        100 g       691            NaN       NaN
f3    Eggplant, raw        100 g        25  Eggplant, raw     0.2 g
f4   Teff, uncooked        100 g       367            NaN       NaN
f5  Sherbet, orange        100 g       144            NaN       NaN

#### Outer Join

- outer join mein donon DataFrames ki rows shamil hon gi
- First DataFrame ki jo values Second mein nahi hen ya Second ki jo values first mein nahi hen wahan NaN aa jay ga

**df1** or **df2** mein jo columns common thy unky left or right versions ban gay.
- jo rows common hen wo donon mein aaen gi
- jo rows sirf **df1** mein hen wo left waly column mein aaen gi
- jo rows sirf **df2** mein hen wo right waly column mein aaen gi

![](resources/outer.png)

In [10]:
df7 = df1.join(df2, lsuffix="_left", rsuffix="_right", how = 'outer')
df7

          name_left serving_size  calories        name_right total_fat
f1       Cornstarch        100 g     381.0        Cornstarch     0.1 g
f2     Nuts, pecans        100 g     691.0               NaN       NaN
f3    Eggplant, raw        100 g      25.0     Eggplant, raw     0.2 g
f4   Teff, uncooked        100 g     367.0               NaN       NaN
f5  Sherbet, orange        100 g     144.0               NaN       NaN
f6              NaN          NaN       NaN  Cauliflower, raw     0.3 g
f7              NaN          NaN       NaN  Taro leaves, raw     0.7 g

#### Join on Column

Yani agar koe column donon DataFrames mein common hai to usky hisab sy join karny ka liya
- pandas.merge() function use karen
- ya phir us column ko index bna dy (kunka join function index ka hisab sy kaam karta hai)

In [27]:
df8 = df1.set_index('name').join(df2.set_index('name'),  how = 'outer')
df8

                 serving_size  calories total_fat
name
Cauliflower, raw          NaN       NaN     0.3 g
Cornstarch              100 g     381.0     0.1 g
Eggplant, raw           100 g      25.0     0.2 g
Nuts, pecans            100 g     691.0       NaN
Sherbet, orange         100 g     144.0       NaN
Taro leaves, raw          NaN       NaN     0.7 g
Teff, uncooked          100 g     367.0       NaN

### <font color='green'> merge() </font>

#### Syntax

In [ ]:
# pandas.merge() Syntax
pandas.merge(left, right, how='inner', on = None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes = ('_x','_y'), copy =True, indicator = False, validate = None)


# pandas.DataFrame.merge() Syntax
DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)

| Function | Description |
| :------: | :--------: |
|Right |Second ya multiple DataFrames ki list jinhen murge karna hai|
|on| *label*, *list* - column ka name jis par DataFrames ko merge karna hai. ya column donon DataFrames mein hona chahiya |
| how|*left*, *right*, *inner*, *outer*, - Ya param join type ko represent karta hai|
|left_on|*label*, *list* ya *array* |
|right_on|*label*, *list* ya *array* |
|left_index|*bool*|
|left_index|*bool*|

#### Key Points

- pandas.merge() or DataFrame.merge() donon aik jesa kaam karty hen.
- Jab coluumn ky hisab sy merge karty hen to indexes ko ignore kar daita hai.

In [40]:
# Creating first DataFrame
food1 = {
    'name' :['Cornstarch','Nuts, pecans','Eggplant, raw','Teff, uncooked','Sherbet, orange'],
    'serving_size' :['100 g', '100 g','100 g','100 g','100 g'],
    'calories' :[381, 691, 25, 367, 144]
}
index_labels1 = ['f1','f2','f3','f4','f5']
df1 = pd.DataFrame(food1, index =index_labels1)
df1

               name serving_size  calories
f1       Cornstarch        100 g       381
f2     Nuts, pecans        100 g       691
f3    Eggplant, raw        100 g        25
f4   Teff, uncooked        100 g       367
f5  Sherbet, orange        100 g       144

In [41]:
# Creating Second DataFrame
food2 = {
    'name' :['Cornstarch','Cauliflower, raw','Eggplant, raw','Taro leaves, raw'],
    'total_fat' :['0.1 g', '0.3 g','0.2 g','0.7 g'],
    'calories' :[381, 25, 25, 42],
    'sodiam' :['9 mg','30 mg','2 mg','3 mg']
}
index_labels2 = ['f1','f6','f3','f7']
df2 = pd.DataFrame(food2, index =index_labels2)
df2

                name total_fat  calories sodiam
f1        Cornstarch     0.1 g       381   9 mg
f6  Cauliflower, raw     0.3 g        25  30 mg
f3     Eggplant, raw     0.2 g        25   2 mg
f7  Taro leaves, raw     0.7 g        42   3 mg

- default setting mein merge() function *inner* join karta hai

#### With Default Parameters

In [42]:
df3 = pd.merge(df1, df2)
df3

#df3 = df1.merge(df2)

            name serving_size  calories total_fat sodiam
0     Cornstarch        100 g       381     0.1 g   9 mg
1  Eggplant, raw        100 g        25     0.2 g   2 mg

#### With on Parameter(Specify Column)

In [43]:

# Merge DataFrames by Columns
df4=pd.merge(df1,df2, on='name')
df4

            name serving_size  calories_x total_fat  calories_y sodiam
0     Cornstarch        100 g         381     0.1 g         381   9 mg
1  Eggplant, raw        100 g          25     0.2 g          25   2 mg

In [44]:
# When column names are different
df5=pd.merge(df1,df2, left_on='name', right_on='name')
df5

            name serving_size  calories_x total_fat  calories_y sodiam
0     Cornstarch        100 g         381     0.1 g         381   9 mg
1  Eggplant, raw        100 g          25     0.2 g          25   2 mg

In [45]:
# Merge DataFrames by Index
df6 = pd.merge(df1,df2,left_index=True,right_index=True)
df6

,name_x,serving_size,calories_x,name_y,total_fat,calories_y,sodiam
f1,Cornstarch,100 g,381,Cornstarch,0.1 g,381,9 mg
f3,"Eggplant, raw",100 g,25,"Eggplant, raw",0.2 g,25,2 mg

#### Merging DataFrames on Multiple Columns

In [46]:
# Use pandas.merge() to on multiple columns
df7 = pd.merge(df1, df2,  how='left', left_on=['name','calories'], right_on = ['name','calories'])
df7

              name serving_size  calories total_fat sodiam
0       Cornstarch        100 g       381     0.1 g   9 mg
1     Nuts, pecans        100 g       691       NaN    NaN
2    Eggplant, raw        100 g        25     0.2 g   2 mg
3   Teff, uncooked        100 g       367       NaN    NaN
4  Sherbet, orange        100 g       144       NaN    NaN

#### With *how* Parameter

In [47]:
# left merge
df8=pd.merge(df1,df2, on='name', how='left')
df8

              name serving_size  calories_x total_fat  calories_y sodiam
0       Cornstarch        100 g         381     0.1 g       381.0   9 mg
1     Nuts, pecans        100 g         691       NaN         NaN    NaN
2    Eggplant, raw        100 g          25     0.2 g        25.0   2 mg
3   Teff, uncooked        100 g         367       NaN         NaN    NaN
4  Sherbet, orange        100 g         144       NaN         NaN    NaN

In [48]:
# right merge
df9=pd.merge(df1,df2, on='name', how='right')
df9

               name serving_size  calories_x total_fat  calories_y sodiam
0        Cornstarch        100 g       381.0     0.1 g         381   9 mg
1  Cauliflower, raw          NaN         NaN     0.3 g          25  30 mg
2     Eggplant, raw        100 g        25.0     0.2 g          25   2 mg
3  Taro leaves, raw          NaN         NaN     0.7 g          42   3 mg

In [49]:
# outer merge
df10=pd.merge(df1,df2, on='name', how='outer')
df10

               name serving_size  calories_x total_fat  calories_y sodiam
0        Cornstarch        100 g       381.0     0.1 g       381.0   9 mg
1      Nuts, pecans        100 g       691.0       NaN         NaN    NaN
2     Eggplant, raw        100 g        25.0     0.2 g        25.0   2 mg
3    Teff, uncooked        100 g       367.0       NaN         NaN    NaN
4   Sherbet, orange        100 g       144.0       NaN         NaN    NaN
5  Cauliflower, raw          NaN         NaN     0.3 g        25.0  30 mg
6  Taro leaves, raw          NaN         NaN     0.7 g        42.0   3 mg

In [50]:
# inner merge
df11=pd.merge(df1,df2, on='name', how='inner')
df11

            name serving_size  calories_x total_fat  calories_y sodiam
0     Cornstarch        100 g         381     0.1 g         381   9 mg
1  Eggplant, raw        100 g          25     0.2 g          25   2 mg

### <font color='green'> append() </font>

In [2]:
import pandas as pd

In [15]:
# Creating first DataFrame
food1 = {
    'name' :['Cornstarch','Nuts, pecans','Eggplant, raw','Teff, uncooked','Sherbet, orange'],
    'serving_size' :['100 g', '100 g','100 g','100 g','100 g'],
    'calories' :[381, 691, 25, 367, 144]
}
index_labels1 = ['f1','f2','f3','f4','f5']
df1 = pd.DataFrame(food1, index =index_labels1)
df1

               name serving_size  calories
f1       Cornstarch        100 g       381
f2     Nuts, pecans        100 g       691
f3    Eggplant, raw        100 g        25
f4   Teff, uncooked        100 g       367
f5  Sherbet, orange        100 g       144

In [16]:
# Creating Second DataFrame
food2 = {
    'name' :['Cornstarch','Cauliflower, raw','Eggplant, raw','Taro leaves, raw'],
    'total_fat' :['0.1 g', '0.3 g','0.2 g','0.7 g'],
    'calories' :[381, 25, 25, 42],
    'sodiam' :['9 mg','30 mg','2 mg','3 mg']
}
index_labels2 = ['f1','f6','f3','f7']
df2 = pd.DataFrame(food2, index =index_labels2)
df2

                name total_fat  calories sodiam
f1        Cornstarch     0.1 g       381   9 mg
f6  Cauliflower, raw     0.3 g        25  30 mg
f3     Eggplant, raw     0.2 g        25   2 mg
f7  Taro leaves, raw     0.7 g        42   3 mg

#### Syntax

In [ ]:
# Syntax of append()
DataFrame.append(other, ignore_index=False, verify_integrity=False, sort=False)

| Function | Description |
| :------: | :--------: |
|Other |Second Dataframe ya multiple DataFrames ki list jinhen murge karna hai|
|ignore_index|*bool* - default value False hai. jab True karty hen to|
|verify_integrity|*bool* - default value False hai. jab True karty hen to duplicateinde x par error show kary ga|
|sort|*bool* - default value False hai. |

Append function second DataFrame ko first DataFrame ki end mein add karta hai.
- Second DataFrame ki columns first DataFrame ki columns ky hisab sy sort karta hai
- Agar koe column first DataFrame mein nahi hai magar second mein hai to us column ko NaN values se fill karta hai and vice versa

In [6]:
# Using append() method
df3 = df1.append(df2)
df3

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_13288\3712007032.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2)

                name serving_size  calories total_fat sodiam
f1        Cornstarch        100 g       381       NaN    NaN
f2      Nuts, pecans        100 g       691       NaN    NaN
f3     Eggplant, raw        100 g        25       NaN    NaN
f4    Teff, uncooked        100 g       367       NaN    NaN
f5   Sherbet, orange        100 g       144       NaN    NaN
f1        Cornstarch          NaN       381     0.1 g   9 mg
f6  Cauliflower, raw          NaN        25     0.3 g  30 mg
f3     Eggplant, raw          NaN        25     0.2 g   2 mg
f7  Taro leaves, raw          NaN        42     0.7 g   3 mg

In [17]:
# Creating first DataFrame
food1 = {
    'name' :['Cornstarch','Nuts, pecans','Eggplant, raw','Teff, uncooked','Sherbet, orange','Cauliflower, raw','Taro leaves, raw','Lamb, raw, ground','Cheese, camembert','Vegetarian fillets'],
    'total_fat' :['0.1g','72g','0.2g','2.4g','2g','0.3g','0.7g','23g','24g','18g'],
    'calories' :[381,691,25,367,144,25,42,282,300,290]
}
index_labels1 = ['f1','f2','f3','f4','f5','f6','f7','f8','f9','f10']
nutrition1 = pd.DataFrame(food1, index =index_labels1)
nutrition1

                   name total_fat  calories
f1           Cornstarch      0.1g       381
f2         Nuts, pecans       72g       691
f3        Eggplant, raw      0.2g        25
f4       Teff, uncooked      2.4g       367
f5      Sherbet, orange        2g       144
f6     Cauliflower, raw      0.3g        25
f7     Taro leaves, raw      0.7g        42
f8    Lamb, raw, ground       23g       282
f9    Cheese, camembert       24g       300
f10  Vegetarian fillets       18g       290

In [18]:
# Creating Second DataFrame
food2 = {
    'name' :['Cauliflower, raw','Taro leaves, raw','Lamb, raw, ground','Cheese, camembert','Vegetarian fillets','PACE, Picante Sauce','Goji berries, dried','Mango nectar, canned','Crackers, rusk toast','Chicken, boiled, feet'],
    'total_fat' :['0.3g','0.7g','23g','24g','18g','0g','0.4g','0.1g','7.2g','15g'],
    'calories' :[25,42,282,300,290,25,349,51,407,215]
}
index_labels2 = ['f6','f7','f8','f9','f10','f11','f12','f13','f14','f15']
nutrition2 = pd.DataFrame(food2, index =index_labels2)
nutrition2

                      name total_fat  calories
f6        Cauliflower, raw      0.3g        25
f7        Taro leaves, raw      0.7g        42
f8       Lamb, raw, ground       23g       282
f9       Cheese, camembert       24g       300
f10     Vegetarian fillets       18g       290
f11    PACE, Picante Sauce        0g        25
f12    Goji berries, dried      0.4g       349
f13   Mango nectar, canned      0.1g        51
f14   Crackers, rusk toast      7.2g       407
f15  Chicken, boiled, feet       15g       215

You can see ka chahy donon DataFrames ky columns same hon ya different, append function second DataFrame ko first ka baad place kar daita hai.
- blew example mein daikh sakty hen ka *f6* row sy *f10* tak values dono DataFrames mein then to wo 2 baarhi sho w ho rahi hen.

In [19]:
nutrition6 = nutrition1.append(nutrition2)
nutrition6

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_13288\2192089908.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  nutrition6 = nutrition1.append(nutrition2)

                      name total_fat  calories
f1              Cornstarch      0.1g       381
f2            Nuts, pecans       72g       691
f3           Eggplant, raw      0.2g        25
f4          Teff, uncooked      2.4g       367
f5         Sherbet, orange        2g       144
f6        Cauliflower, raw      0.3g        25
f7        Taro leaves, raw      0.7g        42
f8       Lamb, raw, ground       23g       282
f9       Cheese, camembert       24g       300
f10     Vegetarian fillets       18g       290
f6        Cauliflower, raw      0.3g        25
f7        Taro leaves, raw      0.7g        42
f8       Lamb, raw, ground       23g       282
f9       Cheese, camembert       24g       300
f10     Vegetarian fillets       18g       290
f11    PACE, Picante Sauce        0g        25
f12    Goji berries, dried      0.4g       349
f13   Mango nectar, canned      0.1g        51
f14   Crackers, rusk toast      7.2g       407
f15  Chicken, boiled, feet       15g       215

#### Reseting Index

Previous result mein index repeat ho rahy thy unhen reset karny ka liya *ignore_index* ko True karen

In [20]:
nutrition7 = nutrition1.append(nutrition2, ignore_index=True)
nutrition7

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_13288\2908342570.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  nutrition7 = nutrition1.append(nutrition2, ignore_index=True)

                     name total_fat  calories
0              Cornstarch      0.1g       381
1            Nuts, pecans       72g       691
2           Eggplant, raw      0.2g        25
3          Teff, uncooked      2.4g       367
4         Sherbet, orange        2g       144
5        Cauliflower, raw      0.3g        25
6        Taro leaves, raw      0.7g        42
7       Lamb, raw, ground       23g       282
8       Cheese, camembert       24g       300
9      Vegetarian fillets       18g       290
10       Cauliflower, raw      0.3g        25
11       Taro leaves, raw      0.7g        42
12      Lamb, raw, ground       23g       282
13      Cheese, camembert       24g       300
14     Vegetarian fillets       18g       290
15    PACE, Picante Sauce        0g        25
16    Goji berries, dried      0.4g       349
17   Mango nectar, canned      0.1g        51
18   Crackers, rusk toast      7.2g       407
19  Chicken, boiled, feet       15g       215

#### Append Dict as Row to DataFrame

Agar DataFrame mein koe row add karna hai to dictionary create kar ka append kar sakty hen

In [12]:
new_row = {'name':"McDONALD'S, Side Salad",'total_fat':'0.2g','calories':20}

nutrition1_1 = nutrition1.append(new_row, ignore_index=True)
nutrition1_1

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_13288\1649062878.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  nutrition1_1 = nutrition1.append(new_row, ignore_index=True)

                      name total_fat  calories
0               Cornstarch      0.1g       381
1             Nuts, pecans       72g       691
2            Eggplant, raw      0.2g        25
3           Teff, uncooked      2.4g       367
4          Sherbet, orange        2g       144
5         Cauliflower, raw      0.3g        25
6         Taro leaves, raw      0.7g        42
7        Lamb, raw, ground       23g       282
8        Cheese, camembert       24g       300
9       Vegetarian fillets       18g       290
10  McDONALD'S, Side Salad      0.2g        20

In [14]:
# Creating third DataFrame
food3 = {
    'name' :["Cookies, Marie biscuit","Broccoli, raw, chinese","McDONALD'S, Hash Brown",'Agave, raw (Southwest)','Emu, raw, outside drum'],
    'total_fat' :['11g','0.8g','16g','0.2g','0.5g'],
    'calories' :[406,30,271,68,103]
}
index_labels3 = ['f16','f17','f18','f19','f20']
nutrition3 = pd.DataFrame(food3, index =index_labels3)
nutrition3

                       name total_fat  calories
f16  Cookies, Marie biscuit       11g       406
f17  Broccoli, raw, chinese      0.8g        30
f18  McDONALD'S, Hash Brown       16g       271
f19  Agave, raw (Southwest)      0.2g        68
f20  Emu, raw, outside drum      0.5g       103

#### Append Multiple DataFrames

In [22]:
nutrition8 = nutrition1.append([nutrition2,nutrition3])
nutrition8

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_13288\1331312724.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  nutrition8 = nutrition1.append([nutrition2,nutrition3])

                       name total_fat  calories
f1               Cornstarch      0.1g       381
f2             Nuts, pecans       72g       691
f3            Eggplant, raw      0.2g        25
f4           Teff, uncooked      2.4g       367
f5          Sherbet, orange        2g       144
f6         Cauliflower, raw      0.3g        25
f7         Taro leaves, raw      0.7g        42
f8        Lamb, raw, ground       23g       282
f9        Cheese, camembert       24g       300
f10      Vegetarian fillets       18g       290
f6         Cauliflower, raw      0.3g        25
f7         Taro leaves, raw      0.7g        42
f8        Lamb, raw, ground       23g       282
f9        Cheese, camembert       24g       300
f10      Vegetarian fillets       18g       290
f11     PACE, Picante Sauce        0g        25
f12     Goji berries, dried      0.4g       349
f13    Mango nectar, canned      0.1g        51
f14    Crackers, rusk toast      7.2g       407
f15   Chicken, boiled, feet       15g       215
f16  Cookies, Marie biscuit       11g       406
f17  Broccoli, raw, chinese      0.8g        30
f18  McDONALD'S, Hash Brown       16g       271
f19  Agave, raw (Southwest)      0.2g        68
f20  Emu, raw, outside drum      0.5g       103

#### *verify_integrity* Parameter

- Agar *verify_integrity* ko True karen gy to duplicate index par error show kary ga
- Iski default value False hai

In [25]:
nutrition9 = nutrition1.append([nutrition2,nutrition3], verify_integrity=True)
nutrition9

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_13288\799274259.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  nutrition9 = nutrition1.append([nutrition2,nutrition3], verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['f6', 'f7', 'f8', 'f9', 'f10'], dtype='object')

In [27]:
nutrition10 = nutrition1.append([nutrition2,nutrition3], sort = True)
nutrition10

C:\Users\Jahanzaib\AppData\Local\Temp\ipykernel_13288\3516966971.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  nutrition10 = nutrition1.append([nutrition2,nutrition3], sort = True)

     calories                    name total_fat
f1        381              Cornstarch      0.1g
f2        691            Nuts, pecans       72g
f3         25           Eggplant, raw      0.2g
f4        367          Teff, uncooked      2.4g
f5        144         Sherbet, orange        2g
f6         25        Cauliflower, raw      0.3g
f7         42        Taro leaves, raw      0.7g
f8        282       Lamb, raw, ground       23g
f9        300       Cheese, camembert       24g
f10       290      Vegetarian fillets       18g
f6         25        Cauliflower, raw      0.3g
f7         42        Taro leaves, raw      0.7g
f8        282       Lamb, raw, ground       23g
f9        300       Cheese, camembert       24g
f10       290      Vegetarian fillets       18g
f11        25     PACE, Picante Sauce        0g
f12       349     Goji berries, dried      0.4g
f13        51    Mango nectar, canned      0.1g
f14       407    Crackers, rusk toast      7.2g
f15       215   Chicken, boiled, feet       15g
f16       406  Cookies, Marie biscuit       11g
f17        30  Broccoli, raw, chinese      0.8g
f18       271  McDONALD'S, Hash Brown       16g
f19        68  Agave, raw (Southwest)      0.2g
f20       103  Emu, raw, outside drum      0.5g

### <font color='green'> concat() </font>

#### Syntax

In [ ]:
pandas.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=True)

In [28]:
# Creating first DataFrame
food1 = {
    'name' :['Cornstarch','Nuts, pecans','Eggplant, raw','Teff, uncooked','Sherbet, orange','Cauliflower, raw','Taro leaves, raw','Lamb, raw, ground','Cheese, camembert','Vegetarian fillets'],
    'total_fat' :['0.1g','72g','0.2g','2.4g','2g','0.3g','0.7g','23g','24g','18g'],
    'calories' :[381,691,25,367,144,25,42,282,300,290]
}
index_labels1 = ['f1','f2','f3','f4','f5','f6','f7','f8','f9','f10']
nutrition1 = pd.DataFrame(food1, index =index_labels1)
nutrition1

                   name total_fat  calories
f1           Cornstarch      0.1g       381
f2         Nuts, pecans       72g       691
f3        Eggplant, raw      0.2g        25
f4       Teff, uncooked      2.4g       367
f5      Sherbet, orange        2g       144
f6     Cauliflower, raw      0.3g        25
f7     Taro leaves, raw      0.7g        42
f8    Lamb, raw, ground       23g       282
f9    Cheese, camembert       24g       300
f10  Vegetarian fillets       18g       290

In [29]:
# Creating Second DataFrame
food2 = {
    'name' :['Cauliflower, raw','Taro leaves, raw','Lamb, raw, ground','Cheese, camembert','Vegetarian fillets','PACE, Picante Sauce','Goji berries, dried','Mango nectar, canned','Crackers, rusk toast','Chicken, boiled, feet'],
    'total_fat' :['0.3g','0.7g','23g','24g','18g','0g','0.4g','0.1g','7.2g','15g'],
    'calories' :[25,42,282,300,290,25,349,51,407,215]
}
index_labels2 = ['f6','f7','f8','f9','f10','f11','f12','f13','f14','f15']
nutrition2 = pd.DataFrame(food2, index =index_labels2)
nutrition2

                      name total_fat  calories
f6        Cauliflower, raw      0.3g        25
f7        Taro leaves, raw      0.7g        42
f8       Lamb, raw, ground       23g       282
f9       Cheese, camembert       24g       300
f10     Vegetarian fillets       18g       290
f11    PACE, Picante Sauce        0g        25
f12    Goji berries, dried      0.4g       349
f13   Mango nectar, canned      0.1g        51
f14   Crackers, rusk toast      7.2g       407
f15  Chicken, boiled, feet       15g       215

In [30]:
# Creating third DataFrame
food3 = {
    'name' :["Cookies, Marie biscuit","Broccoli, raw, chinese","McDONALD'S, Hash Brown",'Agave, raw (Southwest)','Emu, raw, outside drum'],
    'total_fat' :['11g','0.8g','16g','0.2g','0.5g'],
    'calories' :[406,30,271,68,103]
}
index_labels3 = ['f16','f17','f18','f19','f20']
nutrition3 = pd.DataFrame(food3, index =index_labels3)
nutrition3

                       name total_fat  calories
f16  Cookies, Marie biscuit       11g       406
f17  Broccoli, raw, chinese      0.8g        30
f18  McDONALD'S, Hash Brown       16g       271
f19  Agave, raw (Southwest)      0.2g        68
f20  Emu, raw, outside drum      0.5g       103

In [33]:
df = pd.concat([nutrition1, nutrition2])
df

                      name total_fat  calories
f1              Cornstarch      0.1g       381
f2            Nuts, pecans       72g       691
f3           Eggplant, raw      0.2g        25
f4          Teff, uncooked      2.4g       367
f5         Sherbet, orange        2g       144
f6        Cauliflower, raw      0.3g        25
f7        Taro leaves, raw      0.7g        42
f8       Lamb, raw, ground       23g       282
f9       Cheese, camembert       24g       300
f10     Vegetarian fillets       18g       290
f6        Cauliflower, raw      0.3g        25
f7        Taro leaves, raw      0.7g        42
f8       Lamb, raw, ground       23g       282
f9       Cheese, camembert       24g       300
f10     Vegetarian fillets       18g       290
f11    PACE, Picante Sauce        0g        25
f12    Goji berries, dried      0.4g       349
f13   Mango nectar, canned      0.1g        51
f14   Crackers, rusk toast      7.2g       407
f15  Chicken, boiled, feet       15g       215

In [35]:
df2 = pd.concat([nutrition1, nutrition2],ignore_index=True)
df2

                     name total_fat  calories
0              Cornstarch      0.1g       381
1            Nuts, pecans       72g       691
2           Eggplant, raw      0.2g        25
3          Teff, uncooked      2.4g       367
4         Sherbet, orange        2g       144
5        Cauliflower, raw      0.3g        25
6        Taro leaves, raw      0.7g        42
7       Lamb, raw, ground       23g       282
8       Cheese, camembert       24g       300
9      Vegetarian fillets       18g       290
10       Cauliflower, raw      0.3g        25
11       Taro leaves, raw      0.7g        42
12      Lamb, raw, ground       23g       282
13      Cheese, camembert       24g       300
14     Vegetarian fillets       18g       290
15    PACE, Picante Sauce        0g        25
16    Goji berries, dried      0.4g       349
17   Mango nectar, canned      0.1g        51
18   Crackers, rusk toast      7.2g       407
19  Chicken, boiled, feet       15g       215

In [36]:
df2 = pd.concat([nutrition1, nutrition2], axis =1,ignore_index=True)
df2

                      0     1      2                      3     4      5
f1           Cornstarch  0.1g  381.0                    NaN   NaN    NaN
f2         Nuts, pecans   72g  691.0                    NaN   NaN    NaN
f3        Eggplant, raw  0.2g   25.0                    NaN   NaN    NaN
f4       Teff, uncooked  2.4g  367.0                    NaN   NaN    NaN
f5      Sherbet, orange    2g  144.0                    NaN   NaN    NaN
f6     Cauliflower, raw  0.3g   25.0       Cauliflower, raw  0.3g   25.0
f7     Taro leaves, raw  0.7g   42.0       Taro leaves, raw  0.7g   42.0
f8    Lamb, raw, ground   23g  282.0      Lamb, raw, ground   23g  282.0
f9    Cheese, camembert   24g  300.0      Cheese, camembert   24g  300.0
f10  Vegetarian fillets   18g  290.0     Vegetarian fillets   18g  290.0
f11                 NaN   NaN    NaN    PACE, Picante Sauce    0g   25.0
f12                 NaN   NaN    NaN    Goji berries, dried  0.4g  349.0
f13                 NaN   NaN    NaN   Mango nectar, canned  0.1g   51.0
f14                 NaN   NaN    NaN   Crackers, rusk toast  7.2g  407.0
f15                 NaN   NaN    NaN  Chicken, boiled, feet   15g  215.0